const FILM_TYPES = ["科幻片","勵志片","現代片","奇幻片","古裝片","災難片","冒險片","諜戰片","犯罪片","戰爭片"];
const FILM_TAG = ["英雄","警匪","復仇","政治","怪獸","傳奇","浪漫","倫理","藝術","校園","神鬼","穿越","歷史","公路","飆車","機器人","末世","宮廷","槍戰","太空"];
const SHOT_TYPE = ["敘事", "動作", "懸疑", "愛情", "喜劇", "恐怖", "動畫", "歌舞"];
const POSITION = ["主角", "男主角", "女主角", "配角", "男配角", "女配角", "反派"];
const CHARA_TAG = ["癡情","打鬥","搞笑","強壯","硬漢","高顏值","青春","天真","殘酷","反派","瘋狂","大亨","領導者","軍人","超能力","高智商","性感","槍手","忠誠","陰謀家","學生","花花公子","警察","長者","政客","口才好","機靈","醫生","賭徒","罪犯","學者","憂郁","童星","俠客","滄桑","失憶","神職人員","教師","拜金","功夫","記者","間諜","頹廢","藝術家","無常識","貴族","海盜","車手","傭兵","領導","強迫癥","歌手"];
const CHARA_ATTR = ["場面", "表演", "劇情", "藝術", "娛樂"];
const GENDER = ["男", "女"];
const CHARA_NATION = ["歐美", "日韓", "華人"];
const CHARA_FACTION = ["偶像派", "演技派"];
const CHARA_TYPE = ["青春型", "成熟型"];

export { FILM_TYPES, FILM_TAG, SHOT_TYPE, POSITION, CHARA_TAG, CHARA_ATTR, GENDER, CHARA_NATION, CHARA_FACTION, CHARA_TYPE};